/*Завдання 2 - Генератор промісів

Додай в HTML файл розмітку форми. Форма складається з поля вводу для введення значення затримки в мілісекундах, 
двох радіокнопок, які визначають те, як виконається проміс, і кнопки з типом submit, 
при кліку на яку має створюватися проміс.
Напиши скрипт, який після сабміту форми створює проміс. 
В середині колбека цього промісу через вказану користувачем кількість мілісекунд проміс має 
виконуватися (при fulfilled) або відхилятися (при rejected), залежно від обраної опції в радіокнопках. 
Значенням промісу, яке передається як аргумент у методи resolve/reject, має бути значення затримки в мілісекундах.

Створений проміс треба опрацювати у відповідних для вдалого/невдалого виконання методах.

Якщо проміс виконується вдало, виводь у консоль наступний рядок, 
де delay — це значення затримки виклику промісу в мілісекундах.
`✅ Fulfilled promise in ${delay}ms`

Якщо проміс буде відхилено, то виводь у консоль наступний рядок, 
де delay — це значення затримки промісу в мілісекундах.

`❌ Rejected promise in ${delay}ms`
 */

import iziToast from 'izitoast';
import 'izitoast/dist/css/iziToast.min.css';
